{
  "header": {
    "about": "About Me",
    "my-certificates": "My Certificates",
    "recent-projects": "Recent Projects",
    "contact": "Contact",
    "hello": "Hello, ",
    "i-am": "I'm ",
    "petar": "Petar ",
    "stoyanov": "Stoyanov"
  },
  "about-me": {
    "description1": "I am passionate about coding and like to find solutions to complex problems. With approx of 2 years of experience in the field, I have developed a skillset in frontend and backend code development, and I am always eager to learn and take on new challenges.",
    "description2": "My approach to development is analytical, and I believe that this is essential for success. I am dedicated to delivering high-quality work (on time) that meets the requirements while pushing the boundaries of what I can and know.",
    "description3": "In my free time, I like to spend time learning new things and experimenting, which helps to keep me inspired and motivated.",
    "description4": "If you are looking for a person who has \"fire\" for doing things, do not leave when it is hard, always give his best, and always strive to improve, I would love to hear from you.",
    "tech-skills": "Technical skills",
    "soft-skills": "Soft skills",
    "experience": "Experience",
    "education": "Education",
    "skill1": {
      "using": "using ",
      "and": "and",
      "working-database": "Working with databases ",
      "with": "with",
      "beginner": "beginner level",
      "microservice": "Microservices"
    },
    "soft-skills1": {
      "communication": "Communication & Team work",
      "critical": "Problem solving & Critical thinking",
      "pressure": "Work under pressure, Willpower and discipline",
      "ethic": "Work ethic",
      "multitasking": "Ability to multitasking",
      "fast": "Fast learner",
      "persist":"Persistent"
    },
    "experience1": {
      "multiple-addition": "Working on multiple projects including full-time and side clients (2+ years)",
      "projects": "Experimental and Educational projects (4+ years)",
      "assessment": "Projects assessment of students (1.5+ years) in SoftUni",
      "assessment2": "as part of the evaluator committee"
    },
    "education1": {
      "primary": "Primary education completed at the construction,",
      "primary-addition": "architecture and geodesy high school",
      "bachelor": "Bachelor degree for marketing at",
      "bachelor-addition": "the European College in Plovdiv",
      "software": "Software Engineering, Full Stack Developer at SoftUni",
      "development": "Many web development courses on LinkedIn, Udemy, etc."
    }
  },
  "quote": "HARD WORK BEATS TALENT WHEN TALENT DOESN’T WORK HARD.",
  "projects": {
    "project1": {
      "title": "This portfolio",
      "about": "It represents me as a person and professional developer.",
      "modal": {
        "technologies": "React, JavaScript, axios, SCSS, react-toastify, swiper, react-i18next, google analytics & formsubmit",
        "details": "The application was created to introduce some basic techniques in React & CSS, as well as to demonstrate the integration of external libraries.",
        "contribution": "This app was made 100% by me and has the following functionalities:\n•\tDownloading of CV\n•\tChecking of my recent projects\n•\tSending emails\n•\tPreviewing of my: tech skills, soft skills, education and experience\n•\tPreviewing of my certificates",
        "github": "https://github.com/PetarDimitrovStoyanov/my-portfolio",
        "url": "https://petar-stoyanov-portfolio.vercel.app/"
      }
    },
    "project2": {
      "title": "DRC Akkodis",
      "about": "Web app for internal company use only that contains list of projects",
      "modal": {
        "technologies": "Java (v.11) with Spring, VueJS 2, AWS, Docker, BitBucket, Jira, Figma and etc.",
        "details": "This application is intended to be used only by employees throughout the Modis/Akkodis global sales department. It is a platform where employees from all over the world can enter, search and view the won and completed projects, as well as check the specifics related to each project. For example: how many and what teams worked on it, how much time and money it cost, what technologies were used, what results were achieved, and etc.",
        "contribution": "This project was a team work. But my personal contribution is:\n•\tCreating and maintaining of web pages and components by given template design in Figma on VueJS 2 using JavaScript, HTML, CSS and SASS.\n•\tIntegrating of external libraries such as: “vue-router”, “i18n” for translations, “vue-msal” for sign-in from active directories,\"particles”, “axios”, “animate.css”, and others.\n•\t\thave personally created approx.75% of the front-end on the app which I’m working on with the team.\n•\tCreating new REST endopoints on the back-end using Java, Spring Framework, Spring Data JPA, Hibernate, and MySQL.\n•\tImplementing and extending of the project business logic using Domain Driven Design and Hexagonal Architecture such as login, search, CRUD and etc.\n•\tContribution to the integration of external dependencies as: AWS S3, AWS translation, generating of PDF, PPT, and DOCX documents\n•\tI have personally refactored 65% of the back-end and the database (with liquidbase) in order to improve/optimize the performance.\n•\tPart of the projects that implements Agile methodologies and Scrum practices\n",
        "github": "",
        "url": "https://drc-akkodis.com/"
      }
    },
    "project3": {
      "title": "Storage system",
      "about": "Desktop application for issuing of payment notes."
    }
  },
  "submit-form": {
    "errors": {
      "name-required": "Name is required",
      "email-required": "Email is required",
      "email-invalid": "Email is invalid",
      "message-required": "Message is required"
    },
    "placeholders": {
      "your-name": "Your name",
      "your-email": "Your email",
      "your-message": "Your message"
    }
  },
  "notifications": {
    "wrong": "Oops, something went wrong.",
    "success-email": "Your email has been sent successfully.",
    "success-download": "The CV has been downloaded successfully.",
    "error-download": "There was a problem with the downloading of CV."
  },
  "buttons": {
    "download": "Download CV",
    "submit": "Submit"
  },
  "modal": {
    "technologies": "Technologies, tools and libraries: ",
    "source": "Source control system repository: ",
    "url": "Link: ",
    "contribution": "Personal contribution: ",
    "details": "Further information: ",
    "close": "Close"
  }
}
